infra/load-test/results/run1.summary.txt

    ✓ status is 200
    ✓ decision is allowed

    HTTP
    http_req_duration..............: avg=20.55ms min=10.91ms med=17.93ms max=64.92ms p(90)=31.58ms p(95)=37.18ms
      { expected_response:true }...: avg=20.55ms min=10.91ms med=17.93ms max=64.92ms p(90)=31.58ms p(95)=37.18ms
    http_req_failed................: 0.00%  0 out of 1501
    http_reqs......................: 1501   49.902662/s

    EXECUTION
    iteration_duration.............: avg=21.05ms min=11.21ms med=18.46ms max=54.7ms  p(90)=32.16ms p(95)=37.84ms
    iterations.....................: 1501   49.902662/s
    vus............................: 1      min=0         max=1 
    vus_max........................: 20     min=20        max=20

    NETWORK
    data_received..................: 471 kB 16 kB/s
    data_sent......................: 564 kB 19 kB/s



running (0m30.1s), 000/020 VUs, 1501 complete and 0 interrupted iterations
steady_load ✓ [ 100% ] 000/020 VUs  30s  50.00 iters/s